performance.yml
config:
  target: "https://api.todoist.com"
  phases:
    - duration: 1
      arrivalRate: 1
      name: "Phase 1"
  defaults:
   headers:
     Authorization: Bearer {{ $processEnvironment.TOKEN }}
     Content-type: application/json
  ##processor: "./myProcessor.js"
scenarios:
  - flow:
      - get:
          url: "/rest/v1/projects"
      - post:
          url: "/rest/v1/projects"
          json:
            name: "Demo"
          capture: 
           json: "$.id"
           as: "id"
      - log: "Current Id is {{ id }}"
      - get:
          url: "/rest/v1/projects/{{ id }}"
      - post:
          url: "/rest/v1/projects/{{ id }}"
          json:
            name: "WI¡izeline"
      - delete:
          url: "/rest/v1/projects/{{ id }}"
  # For more information: https://artillery.io/docs/script-reference/
# For more information: https://artillery.io/docs/script-reference/